<!-- add-pr-comment:prod-tfplan -->

Terraform plan output for prod

```text


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.backstage.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:us-east-1:235465132804:service/arc-prod-cluster/arc-prod-cluster-backstage"
        name                               = "arc-prod-cluster-backstage"
        tags                               = {
            "Environment" = "prod"
            "MonoRepo"    = "False"
            "Name"        = "arc-prod-cluster-backstage"
            "Project"     = "arc"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:235465132804:task-definition/arc-prod-cluster-backstage:3" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backstage.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:us-east-1:235465132804:task-definition/arc-prod-cluster-backstage:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:235465132804:task-definition/arc-prod-cluster-backstage" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - image                  = "235465132804.dkr.ecr.us-east-1.amazonaws.com/sourcefuse-backstage:main"
                  - mountPoints            = []
                    name                   = "arc-prod-cluster-backstage"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom            = []
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "arc-prod-cluster-backstage" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "MonoRepo"    = "False"
            "Name"        = "arc-prod-cluster-backstage"
            "Project"     = "arc"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

